# RebarTooShortMetric Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarTooShortMetric Property
BuiltInFailures..::..RebarFailures Class See Also
---
The minimum length of rebar shape is 25 mm.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarTooShortMetric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarTooShortMetric As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarTooShortMetric {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace